//==========================================================
/**
 * @fileoverview
 * Библиотека плагинов, классов и функций.
 * Классы и функции инкапсулированы в объекте {@link dc $.dc}.
 *
 * Содержание:
 * 1. Функции - {@link dc.f $.dc.f}
 * 3. Классы - {@link dc.c $.dc.c}
 * 2. {@link module:jQueryPlugins jQuery-плагины}
 */
//==========================================================
(function ($) {
    /**
     * Главный namespace. Все общие данные проекта и библиотеки должны храниться
     * в этом объекте ($.dc).
     * @namespace dc
     */
    $.dc = ($.dc) ? $.dc : {};

    /**
    * Этот namespace содержит библиотеку переменных, констант, структур данных.
    * @memberof dc
    * @namespace d
    */
    $.dc.d = ($.dc.d) ? $.dc.d : {};

    /**
     * Этот namespace содержит библиотеку событий.
     * @memberof dc
     * @namespace e
     */
    $.dc.e = ($.dc.e) ? $.dc.e : {};

    /**
     * Этот namespace содержит библиотеку функций.
     * @memberof dc
     * @namespace f
     */
    $.dc.f = ($.dc.f) ? $.dc.f : {};

    /**
     * Этот namespace содержит набор классов.
     * @memberof dc
     * @namespace c
     */
    $.dc.c = ($.dc.c) ? $.dc.c : {};
})(jQuery);
//==========================================================
